app/Http/Controllers/Auth/AuthController.php

select * from `users` where email = 'admin_sbyketintang1@tiaramas.com' AND status_user = 'aktif' limit 1
---
    public function login(Request $request)
    {
        $email = $request->email;
        $password = $request->password;

        # Check apakah data user ada
        if (
            Auth::attempt(['email' => $email, 'password' => $password, 'status_user' => 'aktif'], $request->checkBoxRememberMe)
        ) {
            # Get data user
            $user = User::whereRaw('email = ? AND status_user = ?', [$email, 'aktif'])->first();