app/Models/Cargo/CargoPengirimanDetail.php

    public function barang($no_lmt)
    {
        $sql = $this->hasMany(CargoPengirimanBarang::class, "no_lmt", "no_lmt");

        $data = array();
        try {
            $data = $sql
            ->select(
                'jumlah_barang',
                'code',
                'jenis_barang',
                'jenis_paket',
                'berat',
                'biaya',
            )
            ->where('no_lmt', ($no_lmt ? decrypt($no_lmt) : $this->no_lmt))
            ->groupBy('no_resi')
            ->first();
---
select `jumlah_barang`, `code`, `jenis_barang`, `jenis_paket`, `berat`, `biaya` from `cargo_pengiriman_barangs` where `cargo_pengiriman_barangs`.`no_lmt` = 2 and `cargo_pengiriman_barangs`.`no_lmt` is not null and `no_lmt` = 2 group by `no_resi` limit 1