app/Models/Cargo/CargoPengirimanDetail.php

select `jumlah_barang`, `code`, `jenis_barang`, `berat`, `biaya` from `cargo_pengiriman_barangs` where `cargo_pengiriman_barangs`.`no_lmt` = 6 and `cargo_pengiriman_barangs`.`no_lmt` is not null and `no_lmt` = '6'
---
    public function barangs($no_lmt)
    {
        $sql = $this->hasMany(CargoPengirimanBarang::class, "no_lmt", "no_lmt");

        $data = array();
        try {
            $data = $sql
            ->select(
                'jumlah_barang',
                'code',
                'jenis_barang',
                'berat',
                'biaya',
            )
            ->where('no_lmt', ($no_lmt ? decrypt($no_lmt) : $this->no_lmt))
            ->get();

select SUM(biaya) as biaya,
SUM(jumlah_barang) as jumlah_barang,
cargo_pengiriman_details.keterangan,
code,
berat,
jenis_barang,
asal,
status_pembayarans.pesan,
DATE(cargo_pengiriman_details.created_at) as created from `cargo_pengiriman_barangs` left join `cargo_pengiriman_details` on `cargo_pengiriman_details`.`no_lmt` = `cargo_pengiriman_barangs`.`no_lmt` left join `status_pembayarans` on `status_pembayarans`.`id_status_pembayaran` = `cargo_pengiriman_details`.`id_status_pembayaran` where `cargo_pengiriman_barangs`.`no_lmt` = 5 and `cargo_pengiriman_barangs`.`no_lmt` is not null and `cargo_pengiriman_details`.`no_lmt` = '5' group by `cargo_pengiriman_details`.`no_lmt` order by `cargo_pengiriman_details`.`created_at` desc limit 1
select code,
berat,
jenis_barang,
cargo_pengiriman_details.asal,
status_pembayarans.pesan,
area_bus.kode_wilayah,
area_bus.kode_kota,
SUM(biaya) as biaya,
SUM(jumlah_barang) as jumlah_barang,
cargo_pengiriman_details.keterangan,
DATE(cargo_pengiriman_details.created_at) as created from `cargo_pengiriman_barangs` left join `cargo_pengiriman_details` on `cargo_pengiriman_details`.`no_lmt` = `cargo_pengiriman_barangs`.`no_lmt` left join `area_bus` on `area_bus`.`wilayah` = `cargo_pengiriman_details`.`asal` left join `status_pembayarans` on `status_pembayarans`.`id_status_pembayaran` = `cargo_pengiriman_details`.`id_status_pembayaran` where `cargo_pengiriman_barangs`.`no_lmt` = 6 and `cargo_pengiriman_barangs`.`no_lmt` is not null and `cargo_pengiriman_details`.`no_lmt` = '6' group by `cargo_pengiriman_details`.`no_lmt` order by `cargo_pengiriman_details`.`created_at` desc limit 1
---
    public function summary($no_lmt)
    {
        $sql = $this->hasMany(CargoPengirimanBarang::class, "no_lmt", "no_lmt");
        $data = $sql
        ->selectRaw(
            'code,
            berat,
            jenis_barang,
            cargo_pengiriman_details.asal,
            status_pembayarans.pesan,
            area_bus.kode_wilayah,
            area_bus.kode_kota,
            SUM(biaya) as biaya,
            SUM(jumlah_barang) as jumlah_barang,
            cargo_pengiriman_details.keterangan,
            DATE(cargo_pengiriman_details.created_at) as created',
        )
        ->leftJoin("cargo_pengiriman_details", "cargo_pengiriman_details.no_lmt", "cargo_pengiriman_barangs.no_lmt")
        ->leftJoin("area_bus", "area_bus.wilayah", "cargo_pengiriman_details.asal")
        ->leftJoin("status_pembayarans", "status_pembayarans.id_status_pembayaran", "cargo_pengiriman_details.id_status_pembayaran")
        ->where("cargo_pengiriman_details.no_lmt", ($no_lmt ? decrypt($no_lmt) : $this->no_lmt))
        ->orderByDesc('cargo_pengiriman_details.created_at')
        ->groupBy("cargo_pengiriman_details.no_lmt")
        ->first()