app/User.php

select id_cargo_pengiriman_barang,
cargo_pengiriman_details.no_lmt,
cargo_pengiriman_details.no_resi,
cargo_pengiriman_details.no_manifest,
nama_pengirim,
nama_penerima,
kode_kotas.kota as tujuan,
jenis_pengiriman,
SUM(cargo_pengiriman_barangs.biaya) as biaya,
SUM(cargo_pengiriman_barangs.jumlah_barang) as jumlah_barang,
MAX(message_trackings.id_message_tracking) as last_id_message_tracking,
keterangan,
status_pembayarans.id_status_pembayaran,
is_lunas,
is_diterima,
DATE(cargo_pengiriman_details.created_at) as created from `cargo_pengiriman_details` left join `cargo_pengiriman_barangs` on `cargo_pengiriman_barangs`.`no_lmt` = `cargo_pengiriman_details`.`no_lmt` left join `trackings` on `trackings`.`no_lmt` = `cargo_pengiriman_details`.`no_lmt` left join `kode_kotas` on `kode_kotas`.`id_kode_kota` = `cargo_pengiriman_details`.`id_kode_kota_tujuan` left join `message_trackings` on `message_trackings`.`id_message_tracking` = `trackings`.`id_message_tracking` left join `status_pembayarans` on `status_pembayarans`.`id_status_pembayaran` = `cargo_pengiriman_details`.`id_status_pembayaran` group by `cargo_pengiriman_details`.`no_lmt` order by `cargo_pengiriman_barangs`.`created_at` desc
---
            ->leftJoin("message_trackings", "message_trackings.id_message_tracking", "trackings.id_message_tracking")
            ->leftJoin("status_pembayarans", "status_pembayarans.id_status_pembayaran", "cargo_pengiriman_details.id_status_pembayaran")

            ->orderByDesc('cargo_pengiriman_barangs.created_at')
            ->groupBy("cargo_pengiriman_details.no_lmt")
            ->get()

select id_cargo_pengiriman_barang,
cargo_pengiriman_details.no_lmt,
cargo_pengiriman_details.no_resi,
cargo_pengiriman_details.no_manifest,
nama_pengirim,
nama_penerima,
kode_kotas.kota as tujuan,
jenis_pengiriman,
SUM(cargo_pengiriman_barangs.biaya) as biaya,
SUM(cargo_pengiriman_barangs.jumlah_barang) as jumlah_barang,
MAX(message_trackings.id_message_tracking) as last_id_message_tracking,
keterangan,
status_pembayarans.id_status_pembayaran,
is_lunas,
is_diterima,
cargo_pengiriman_details.jenis_pengiriman,
DATE(cargo_pengiriman_details.created_at) as created from `cargo_pengiriman_details` left join `cargo_pengiriman_barangs` on `cargo_pengiriman_barangs`.`no_lmt` = `cargo_pengiriman_details`.`no_lmt` left join `trackings` on `trackings`.`no_lmt` = `cargo_pengiriman_details`.`no_lmt` left join `kode_kotas` on `kode_kotas`.`id_kode_kota` = `cargo_pengiriman_details`.`id_kode_kota_tujuan` left join `message_trackings` on `message_trackings`.`id_message_tracking` = `trackings`.`id_message_tracking` left join `status_pembayarans` on `status_pembayarans`.`id_status_pembayaran` = `cargo_pengiriman_details`.`id_status_pembayaran` where `cargo_pengiriman_details`.`id_user` = 2 and `cargo_pengiriman_details`.`jenis_pengiriman` = 'truk' or `cargo_pengiriman_details`.`id_kode_kota_tujuan` in ('1') group by `cargo_pengiriman_details`.`no_lmt` order by `cargo_pengiriman_barangs`.`created_at` desc
---

                ->leftJoin("kode_kotas", "kode_kotas.id_kode_kota", "cargo_pengiriman_details.id_kode_kota_tujuan")

                ->leftJoin("message_trackings", "message_trackings.id_message_tracking", "trackings.id_message_tracking")
                ->leftJoin("status_pembayarans", "status_pembayarans.id_status_pembayaran", "cargo_pengiriman_details.id_status_pembayaran")
                ->where("cargo_pengiriman_details.id_user", $this->id)
                ->where("cargo_pengiriman_details.jenis_pengiriman", $this->jenis_user)

select id_cargo_pengiriman_barang,
cargo_pengiriman_details.no_lmt,
cargo_pengiriman_details.no_resi,
cargo_pengiriman_details.no_manifest,
nama_pengirim,
nama_penerima,
kode_kotas.kota as tujuan,
jenis_pengiriman,
SUM(cargo_pengiriman_barangs.biaya) as biaya,
SUM(cargo_pengiriman_barangs.jumlah_barang) as jumlah_barang,
MAX(message_trackings.id_message_tracking) as last_id_message_tracking,
keterangan,
status_pembayarans.id_status_pembayaran,
is_lunas,
is_diterima,
cargo_pengiriman_details.jenis_pengiriman,
DATE(cargo_pengiriman_details.created_at) as created from `cargo_pengiriman_details` left join `cargo_pengiriman_barangs` on `cargo_pengiriman_barangs`.`no_lmt` = `cargo_pengiriman_details`.`no_lmt` left join `trackings` on `trackings`.`no_lmt` = `cargo_pengiriman_details`.`no_lmt` left join `kode_kotas` on `kode_kotas`.`id_kode_kota` = `cargo_pengiriman_details`.`id_kode_kota_tujuan` left join `message_trackings` on `message_trackings`.`id_message_tracking` = `trackings`.`id_message_tracking` left join `status_pembayarans` on `status_pembayarans`.`id_status_pembayaran` = `cargo_pengiriman_details`.`id_status_pembayaran` where `cargo_pengiriman_details`.`id_user` = 5 and `cargo_pengiriman_details`.`jenis_pengiriman` = 'bus' or `cargo_pengiriman_details`.`id_kode_kota_tujuan` in ('4') group by `cargo_pengiriman_details`.`no_lmt` order by `cargo_pengiriman_barangs`.`created_at` desc
---

                ->leftJoin("kode_kotas", "kode_kotas.id_kode_kota", "cargo_pengiriman_details.id_kode_kota_tujuan")

                ->leftJoin("message_trackings", "message_trackings.id_message_tracking", "trackings.id_message_tracking")
                ->leftJoin("status_pembayarans", "status_pembayarans.id_status_pembayaran", "cargo_pengiriman_details.id_status_pembayaran")
                ->where("cargo_pengiriman_details.id_user", $this->id)
                ->where("cargo_pengiriman_details.jenis_pengiriman", $this->jenis_user)

select distinct id_cargo_pengiriman_detail,
no_manifest,
cargo_pengiriman_details.no_pol,
sopir,
sopir_utama,
jenis_pengiriman,
cargo_pengiriman_details.id_kode_kota_asal as asal,
cargo_pengiriman_details.id_kode_kota_tujuan as tujuan,
MAX(message_trackings.id_message_tracking) as last_id_message_tracking,
DATE(cargo_pengiriman_details.created_at) as created from `cargo_pengiriman_details` left join `trucks` on `trucks`.`no_pol` = `cargo_pengiriman_details`.`no_pol` left join `trackings` on `trackings`.`no_lmt` = `cargo_pengiriman_details`.`no_lmt` left join `message_trackings` on `message_trackings`.`id_message_tracking` = `trackings`.`id_message_tracking` left join `kode_kotas` on `kode_kotas`.`id_kode_kota` = `cargo_pengiriman_details`.`id_kode_kota_tujuan` where `no_manifest` is not null and `cargo_pengiriman_details`.`id_user` = 7 or `cargo_pengiriman_details`.`id_kode_kota_tujuan` = '2' group by `cargo_pengiriman_details`.`no_manifest` order by `cargo_pengiriman_details`.`created_at` desc
---
    public function manifests($tujuan)
    {
        $data = array();
        if($this->name == "superadmin"){
            // Untuk check semua manifest
            $data = CargoPengirimanDetail::selectRaw(
                'id_cargo_pengiriman_detail,
                no_manifest,
                cargo_pengiriman_details.no_pol,
                sopir,
                sopir_utama,
                jenis_pengiriman,
                cargo_pengiriman_details.id_kode_kota_asal as asal,
                cargo_pengiriman_details.id_kode_kota_tujuan as tujuan,
                MAX(message_trackings.id_message_tracking) as last_id_message_tracking,
                DATE(cargo_pengiriman_details.created_at) as created',
            )
            ->leftJoin("trucks", "trucks.no_pol", "cargo_pengiriman_details.no_pol")
            ->leftJoin("trackings", "trackings.no_lmt", "cargo_pengiriman_details.no_lmt")
            ->leftJoin("message_trackings", "message_trackings.id_message_tracking", "trackings.id_message_tracking")
            ->leftJoin("kode_kotas", "kode_kotas.id_kode_kota", "cargo_pengiriman_details.id_kode_kota_tujuan")
            ->where('no_manifest', "!=", null)
            ->orderByDesc('cargo_pengiriman_details.created_at')
            ->groupBy("cargo_pengiriman_details.no_manifest")
            ->distinct()
            ->get()
            ;
        } else {
            if($this->jenis_user == "truk"){
                // Untuk check semua manifest
                $data = CargoPengirimanDetail::selectRaw(
                    'id_cargo_pengiriman_detail,
                    no_manifest,
                    cargo_pengiriman_details.no_pol,
                    sopir,
                    sopir_utama,
                    jenis_pengiriman,
                    cargo_pengiriman_details.id_kode_kota_asal as asal,
                    cargo_pengiriman_details.id_kode_kota_tujuan as tujuan,
                    MAX(message_trackings.id_message_tracking) as last_id_message_tracking,
                    DATE(cargo_pengiriman_details.created_at) as created',
                )
                ->leftJoin("trucks", "trucks.no_pol", "cargo_pengiriman_details.no_pol")
                ->leftJoin("trackings", "trackings.no_lmt", "cargo_pengiriman_details.no_lmt")
                ->leftJoin("message_trackings", "message_trackings.id_message_tracking", "trackings.id_message_tracking")
                ->leftJoin("kode_kotas", "kode_kotas.id_kode_kota", "cargo_pengiriman_details.id_kode_kota_tujuan")
                ->where('no_manifest', "!=", null)
                ->where('cargo_pengiriman_details.id_user', $this->id)
                ->orWhere('cargo_pengiriman_details.id_kode_kota_tujuan', $tujuan)
                ->orderByDesc('cargo_pengiriman_details.created_at')
                ->groupBy("cargo_pengiriman_details.no_manifest")
                ->distinct()