app/Http/Controllers/CargoManifestController.php

    public function createManifestBus(Request $request)
    {
        $no_manifest = CargoPengirimanDetail::select('no_manifest')->max('no_manifest') ? CargoPengirimanDetail::select('no_manifest')->max('no_manifest') + 1 : 1;

        if(
            !$request->no_pol
            || !$request->no_lmt
        ){
            $data = array();
            $data['message'] = 'Error pada input';
            return redirect()->back()->withErrors($data)->withInput();
        }

        if(
            count($request->no_lmt) <= 0
            || count($request->no_lmt) > 27
        ){
            $data = array();
            $data['message'] = 'Jumlah resi salah pada input';
            return redirect()->back()->withErrors($data)->withInput();
        }
        $no_pol = Bus::cariNoPol($request->no_pol)->no_pol;
        for ($i=0; $i < count($request->no_lmt); $i++) {
            $detail = CargoPengirimanDetail::where('no_lmt', $request->no_lmt[$i])->first();
---
select max(`no_manifest`) as aggregate from `cargo_pengiriman_details`
select * from `cargo_pengiriman_details` where `no_lmt` = '2' limit 1

            $tracking->id_kode_kota_tujuan = $detail->id_kode_kota_tujuan;

            $tracking->id_user = $request->user->id;
            $tracking->save();
---
insert into `trackings` (`no_lmt`, `id_message_tracking`, `id_status_pembayaran`, `id_kode_kota_tujuan`, `id_user`, `updated_at`, `created_at`) values ('2', 1, '1', '4', 4, '2023-02-04 05:28:22', '2023-02-04 05:28:22')

    public function getManifest(Request $request)
    {
        if($request->user->is_user_superadmin){
            // Untuk membuat manifest
            $data = CargoPengirimanDetail::
            selectRaw(
                'id_cargo_pengiriman_detail,
                cargo_pengiriman_details.no_lmt,
                nama_pengirim,
                status_pembayarans.pesan,
                DATE(cargo_pengiriman_barangs.created_at) as created',
            )
            ->leftJoin("status_pembayarans", "status_pembayarans.id_status_pembayaran", "cargo_pengiriman_details.id_status_pembayaran")
            ->leftJoin('cargo_pengiriman_barangs', 'cargo_pengiriman_barangs.no_lmt', 'cargo_pengiriman_details.no_lmt')
            ->where('no_manifest', null)
            ->where('cargo_pengiriman_details.id_kode_kota_tujuan', $request->tujuan)

            ->orderBy('status_pembayarans.id_status_pembayaran', 'ASC')
            ->groupBy("cargo_pengiriman_details.no_lmt")
            ->get();

            return response()->json(["data" => $data]);
        }else{
            // Untuk membuat manifest
            $data = CargoPengirimanDetail::
            selectRaw(
                'id_cargo_pengiriman_detail,
                cargo_pengiriman_details.no_lmt,
                nama_pengirim,
                status_pembayarans.pesan,
                DATE(cargo_pengiriman_barangs.created_at) as created',
            )
            ->leftJoin("status_pembayarans", "status_pembayarans.id_status_pembayaran", "cargo_pengiriman_details.id_status_pembayaran")
            ->leftJoin('cargo_pengiriman_barangs', 'cargo_pengiriman_barangs.no_lmt', 'cargo_pengiriman_details.no_lmt')
            ->leftJoin("kode_kotas", "kode_kotas.id_kode_kota", "cargo_pengiriman_details.id_kode_kota_tujuan")
            ->where('no_manifest', null)
            ->where('id_user', $request->user->id)
            ->where('cargo_pengiriman_details.id_kode_kota_tujuan', $request->tujuan)
---
select id_cargo_pengiriman_detail,
cargo_pengiriman_details.no_lmt,
nama_pengirim,
status_pembayarans.pesan,
DATE(cargo_pengiriman_barangs.created_at) as created from `cargo_pengiriman_details` left join `status_pembayarans` on `status_pembayarans`.`id_status_pembayaran` = `cargo_pengiriman_details`.`id_status_pembayaran` left join `cargo_pengiriman_barangs` on `cargo_pengiriman_barangs`.`no_lmt` = `cargo_pengiriman_details`.`no_lmt` left join `kode_kotas` on `kode_kotas`.`id_kode_kota` = `cargo_pengiriman_details`.`id_kode_kota_tujuan` where `no_manifest` is null and `id_user` = 5 and `cargo_pengiriman_details`.`id_kode_kota_tujuan` is null group by `cargo_pengiriman_details`.`no_lmt` order by `status_pembayarans`.`id_status_pembayaran` asc

    public function updateSampai(Request $request)
    {
        // by no manifest
        if($request->no_manifest){
            try {
                $no_manifest = decrypt($request->no_manifest);

                $detail = CargoPengirimanDetail::
                selectRaw(
                    "
                    cargo_pengiriman_details.id_kode_kota_tujuan,
                    MAX(trackings.id_message_tracking) as id_message_tracking_last,
                    cargo_pengiriman_details.created_at
                    ",
                    )
                ->leftJoin("trackings", "trackings.no_lmt", "cargo_pengiriman_details.no_lmt")
                ->where('no_manifest', $no_manifest)
                ->where('trackings.id_message_tracking', "!=", null)
                ->first()
---
select
cargo_pengiriman_details.id_kode_kota_tujuan,
MAX(trackings.id_message_tracking) as id_message_tracking_last,
cargo_pengiriman_details.created_at
from `cargo_pengiriman_details` left join `trackings` on `trackings`.`no_lmt` = `cargo_pengiriman_details`.`no_lmt` where `no_manifest` = '2' and `trackings`.`id_message_tracking` is not null limit 1