app/Http/Controllers/CargoPengirimanTrukController.php

    public function storeTrukDeliveryNote(Request $request){
        $data = array();

        try {
            $detail = CargoPengirimanDetail::where('no_lmt', decrypt($request->no_lmt))->first();
---
select * from `cargo_pengiriman_details` where `no_lmt` = 14 limit 1