app/Http/Controllers/CargoPengirimanController.php

select
cargo_pengiriman_details.*,
kode_kotas.kota as tujuan,
bus.*,
status_pembayarans.pesan
from `cargo_pengiriman_details` left join `status_pembayarans` on `status_pembayarans`.`id_status_pembayaran` = `cargo_pengiriman_details`.`id_status_pembayaran` left join `kode_kotas` on `kode_kotas`.`id_kode_kota` = `cargo_pengiriman_details`.`id_kode_kota_tujuan` left join `bus` on `bus`.`no_pol` = `cargo_pengiriman_details`.`no_pol` where `no_lmt` = 2 limit 1
---
    public function storeBusResiNote(Request $request){
        $data = array();
        try {
            $detail = CargoPengirimanDetail::
                selectRaw(
                    "
                    cargo_pengiriman_details.*,
                    kode_kotas.kota as tujuan,
                    bus.*,
                    status_pembayarans.pesan
                    "
                )
                ->leftJoin("status_pembayarans", "status_pembayarans.id_status_pembayaran", "cargo_pengiriman_details.id_status_pembayaran")
                ->leftJoin("kode_kotas", "kode_kotas.id_kode_kota", "cargo_pengiriman_details.id_kode_kota_tujuan")
                ->leftJoin("bus", "bus.no_pol", "cargo_pengiriman_details.no_pol")
                ->where('no_lmt', decrypt($request->no_lmt))
                ->first();
        } catch (\Throwable $th) {
            return abort(404);
        }
        $data = $detail->barang($request->no_lmt);
        $detail->user = $request->user->kodeKota();

        $detail->created = date_format(date_create($detail->created_at->toDateString(), timezone_open("Asia/Jakarta")), 'd F Y');

        $asal = CargoPengirimanDetail::
        selectRaw(
            "
            kode_kotas.kota as asal
            "
        )
        ->leftJoin("kode_kotas", "kode_kotas.id_kode_kota", "cargo_pengiriman_details.id_kode_kota_asal")
        ->where('no_lmt', decrypt($request->no_lmt))
        ->first()->asal;