app/Http/Controllers/HomeController.php

select
message_trackings.pesan,
DATE(trackings.created_at) as created from `cargo_pengiriman_details` left join `trackings` on `trackings`.`no_lmt` = `cargo_pengiriman_details`.`no_lmt` left join `message_trackings` on `message_trackings`.`id_message_tracking` = `trackings`.`id_message_tracking` left join `trucks` on `trucks`.`no_pol` = `cargo_pengiriman_details`.`no_pol` where `cargo_pengiriman_details`.`no_lmt` = '1' limit 3 offset 0
---
    protected function pageGuest(Request $request)
    {
        $data = array();
        if($request->r){
            try {
                $no_lmt = decrypt($request->r);
                // $no_lmt = $request->r;

                // Untuk membuat manifest
                $detail = CargoPengirimanDetail::
                selectRaw(
                    '
                    message_trackings.pesan,
                    DATE(trackings.created_at) as created',
                )
                ->leftJoin("trackings", "trackings.no_lmt", "cargo_pengiriman_details.no_lmt")
                ->leftJoin("message_trackings", "message_trackings.id_message_tracking", "trackings.id_message_tracking")
                ->leftJoin("trucks", "trucks.no_pol", "cargo_pengiriman_details.no_pol")
                ->where('cargo_pengiriman_details.no_lmt', $no_lmt)
                ->skip(0)->take(3)
                ->get();