app/Http/Controllers/Bus/CargoPengirimanBusController.php

    public function storeBusResi(Request $request){
        $data = array();

        try {
            $detail = CargoPengirimanDetail::where('no_lmt', decrypt($request->no_lmt))->first();
---
select * from `cargo_pengiriman_details` where `no_lmt` = 1 limit 1

    public function storeBusBarang(Request $request){
        $data = array();

        try {
            $detail = CargoPengirimanDetail::where('no_lmt', decrypt($request->no_lmt))->first();
---
select * from `cargo_pengiriman_details` where `no_lmt` = '5' limit 1