app/Http/Controllers/Bus/ManifestBusController.php

    public function storeCetakManifestBus(Request $request){
        try {
            $no_manifest = decrypt($request->no_manifest);
            $detail = CargoPengirimanDetail::
            selectRaw(
                'cargo_pengiriman_details.nama_pengirim,
                cargo_pengiriman_details.nama_penerima,
                cargo_pengiriman_details.no_resi,
                SUM(cargo_pengiriman_barangs.biaya) as biaya,
                SUM(cargo_pengiriman_barangs.jumlah_barang) as jumlah_barang,
                keterangan,
                jenis_paket,
                status_pembayarans.pesan,
                DATE(cargo_pengiriman_details.created_at) as created',
            )
            ->leftJoin("status_pembayarans", "status_pembayarans.id_status_pembayaran", "cargo_pengiriman_details.id_status_pembayaran")
            ->leftJoin("cargo_pengiriman_barangs", "cargo_pengiriman_barangs.no_resi", "cargo_pengiriman_details.no_resi")
            ->groupBy("cargo_pengiriman_details.no_resi")
            ->where('no_manifest', $no_manifest)
            ->get();

            $resume = CargoPengirimanDetail::
            selectRaw(
                '
                SUM(cargo_pengiriman_barangs.jumlah_barang) as jumlah_barang,
                SUM(cargo_pengiriman_barangs.biaya) as totalBiaya
                ',
            )
            ->leftJoin("cargo_pengiriman_barangs", "cargo_pengiriman_barangs.no_resi", "cargo_pengiriman_details.no_resi")
            ->groupBy("cargo_pengiriman_details.no_manifest")
            ->where('no_manifest', $no_manifest)
            ->first();
---
select cargo_pengiriman_details.nama_pengirim,
cargo_pengiriman_details.nama_penerima,
cargo_pengiriman_details.no_resi,
SUM(cargo_pengiriman_barangs.biaya) as biaya,
SUM(cargo_pengiriman_barangs.jumlah_barang) as jumlah_barang,
keterangan,
jenis_paket,
status_pembayarans.pesan,
DATE(cargo_pengiriman_details.created_at) as created from `cargo_pengiriman_details` left join `status_pembayarans` on `status_pembayarans`.`id_status_pembayaran` = `cargo_pengiriman_details`.`id_status_pembayaran` left join `cargo_pengiriman_barangs` on `cargo_pengiriman_barangs`.`no_resi` = `cargo_pengiriman_details`.`no_resi` where `no_manifest` = 1 group by `cargo_pengiriman_details`.`no_resi`
select
SUM(cargo_pengiriman_barangs.jumlah_barang) as jumlah_barang,
SUM(cargo_pengiriman_barangs.biaya) as totalBiaya
from `cargo_pengiriman_details` left join `cargo_pengiriman_barangs` on `cargo_pengiriman_barangs`.`no_resi` = `cargo_pengiriman_details`.`no_resi` where `no_manifest` = 1 group by `cargo_pengiriman_details`.`no_manifest` limit 1